{
    "header": {
        "title": "👋 Meu nome é Ge e sou um Front-end",
        "description": "Desenvolvedor Frontend com formação em design, focado em criar experiências digitais funcionais e resolver problemas complexos com soluções de alta qualidade. <i><b> Como posso te ajudar? </b></i>"
    },
    "Navigation": {
        "home": "Início",
        "about": "Sobre mim",
        "projects": "Projetos"
    },
    "LocaleSwitcher": {
        "pt": "🇧🇷 Português",
        "en": "🇺🇸 Inglês",
        "label": "Idioma"
    },
    "Footer": {
        "title": "Sempre explorando novas formas de unir design e tecnologia. Vamos construir algo incrível juntos.",
        "email": "geniilsonfernandes@gmail.com",
        "phone": "+ 55 22 99602 1627"
    },
    "About": {
        "title": "👋 Olá! Eu sou o Genilson Fernandes",
        "description": "<p>Desenvolvedor Frontend com uma formação em design. Minha trajetória profissional é focada em criar experiências digitais significativas e funcionais.</p> <p>💼 Com experiência valiosa na Beuni Tech e na Teamsoft, contribuí para o desenvolvimento de soluções robustas e inovadoras. Meu compromisso com a resolução de problemas e a implementação de novas funcionalidades tem sido constante em cada projeto em que estive envolvido.</p><p> 🚀 Ao longo dos anos, aprimorei meu entendimento de processos e de resolução de problemas complexos, sempre buscando entregar soluções de alta qualidade. Estou comprometido com o aprendizado e crescimento profissional, sempre buscando melhorar minhas habilidades técnicas e interpessoais.</p>"
    },
    "Stack": {
        "front-end": {
            "title": "Front-end",
            "description": "Desenvolvimento de interfaces e aplicações web com foco na experiência do usuário.",
            "icon": "Terminal"
        },
        "back-end": {
            "title": "Back-end",
            "description": "Desenvolvimento de APIs e lógica de servidor para dar suporte a aplicações e serviços web.",
            "icon": "Terminal"
        },
        "mobile": {
            "title": "Mobile",
            "description": "Desenvolvimento de aplicativos móveis para plataformas iOS e Android usando Expo.",
            "icon": "Terminal"
        },
        "automated-testing": {
            "title": "Testes Automatizados",
            "description": "Implementação de testes automatizados para garantir a qualidade e robustez de APIs e aplicações.",
            "icon": "Terminal"
        },
        "clean-code": {
            "title": "Código Limpo",
            "description": "Escrita de código limpo e legível, seguindo as melhores práticas e padrões de desenvolvimento.",
            "icon": "Terminal"
        },
        "ux-ui": {
            "title": "UX/UI",
            "description": "Design e implementação de interfaces de usuário intuitivas e atraentes para proporcionar uma experiência excepcional.",
            "icon": "Terminal"
        }
    },
    "Projects": {
        "title": "Todos os projetos",
        "description": "Aqui estão alguns dos projetos em que trabalhei, focando no desenvolvimento de soluções de software eficientes e inovadoras para enfrentar desafios complexos de frontend.",
        "money_guard": {
            "title": "Money Guard",
            "description": "<p>Money Guard é um aplicativo de controle financeiro focado no gerenciamento mensal, definição de metas, tendo o salário do usuário como ponto central. Com ele, é possível acompanhar a renda de forma mais eficiente, definir objetivos e economizar dinheiro.</p> <p>Este aplicativo surgiu da necessidade de substituir o Google Sheets por um sistema mais completo. Minha esposa e eu enfrentamos limitações usando o Google Sheets para gerenciar nossas finanças, o que nos motivou a criar o Money Guard.</p>"
        },
        "cover": "/images/money_guard_cover.png",
        "youtube": "https://www.youtube.com/watch?v=QpV5Y5kXbq4",
        "github": "https://github.com/geniilsonfernandes/moneyguard",
        "status": "pronto",
        "technologies": [
            "Next.js",
            "React",
            "Tailwind",
            "Typescript",
            "Prisma",
            "Docker",
            "Redux",
            "Jest",
            "Vercel",
            "Figma"
        ]
    }
}